Repository: gcazaciuc/jstwister
Catalog: locales/*/messages.po
Languages: ro

source: 0 down-payment
ro: 0 avans

source: An error occurred.
ro: A survenit o eroare.

source: Benefits
ro: Beneficii

source: Book a call
ro: Stabileste o intalnire

source: Build
ro: Dezvolta

source: Buy it anytime
ro: Cumpara oricand

source: Client portal
ro: Zona client

source: Contact us
ro: Contactati-ne

source: Cost control
ro: Control costuri

source: Email Address
ro: Adresa de email

source: Exceptional service
ro: Serviciu exceptional

source: Explore the benefits you get
ro: Exploreaza beneficiile pe care le primesti

source: Frequently Asked Questions
ro: Intrebari frecvente

source: Full service
ro: Servicii complete

source: Get your custom website created by us in a few easy steps
ro: Iti creem propriul site web in cativa pasi simpli

source: Hand crafted
ro: Creem manual

source: Have something in mind ?
ro: Te gandesti la altceva ?

source: Home
ro: Acasa

source: How can help you?
ro: Cum te putem ajuta ?

source: How can you help me get more business ?
ro: Cum ma puteti ajuta sa imi cresc business-ul ?

source: How it works
ro: Cum functioneaza

source: How much will my website cost ?
ro: Cat ma va costa site-ul ?

source: Latest from the blog
ro: Ultimele noutati de pe blog

source: Launch
ro: Lanseaza

source: Let's have a chat...
ro: Hai sa discutam...

source: Login
ro: Intra in cont

source: Mail us 24/7 hello@netcraft.digital
ro: Contacteaza-ne pe email 24/7 la hello@netcraft.digital

source: Maintain
ro: Intretinere

source: Maintainance
ro: Intretinere

source: Maintainance & support included
ro: Intretinere & suport incluse

source: Message sent!
ro: Mesaj trimis!

source: Monthly security & critical fixes included
ro: Fix-uri lunare de securitate

source: Most popular
ro: Popular

source: No upfront costs
ro: Fara costuri in avans

source: Optimize your expenses
ro: Optimizeaza-ti cheltuielile

source: Our blog
ro: Blogul nostru

source: Perfect for 1-10 pages presentation websites
ro: Perfect pentru site-uri de prezentare de 1-10 pagini

source: Permanent security, performance and uptime monitoring
ro: Monitorizare permanenta securitate, performanta si uptime

source: Plans
ro: Abonamente

source: Read More
ro: Citeste mai mult

source: Read more about engineering and design
ro: Citeste mai multe despre inginerie, design si business

source: Rent your website, custom built to your specifications, for a flat monthly fee. No upfront development costs, full service included.
ro: Inchiriaza site-ul web, special construit conform preferintelor tale, pentru un pret fix lunar. Fara costuri in avans, servicii multiple incluse.

source: See plans
ro: Vezi abonamente

source: Services We Provide On Subscription
ro: Servicii care le furnizam pe abonament

source: Simple pricing with no hidden fees.
ro: Preturi usor de inteles, fara costuri ascunse.

source: Sorry for the incovenience. Please try again shortly.
ro: Ne pare rau pentru neplacere. Va rugam incercati din nou in curand.

source: Start now with no risks
ro: Incepe acum fara nici un risc

source: Start right away â€” cancel anytime, no contract, no risk.
ro: Incepe imediat - anuleaza oricand, fara contract, fara riscuri.

source: Start your project immediately: no unreliable freelancers, no interviews, no hiring, no proposals, no unforeseen costs. Cancel anytime if unsatisfied.
ro: Incepe-ti proiectul imediat: fara freelanceri pe care nu te poti baza, fara interviuri, fara agentii scumpe, fara costuri neprevazute. Anuleaza oricand daca esti nemultumit.

source: Starting from 49 EUR/m
ro: Incepand de la 49 EUR/luna

source: Subscribe
ro: Aboneaza-te

source: Subscribe to a plan. After that, we'll build your custom presentation website according to your specifications, FOR FREE. We only charge a flat monthly fee for support, maintainance and hosting, no strings attached.
ro: Aboneaza-te la unul din abonamentele noastre. Dupa aceea, iti vom cream un site web conform preferintele tale.

source: Technologies We Use
ro: Technologiile care le folosim

source: Technology
ro: Technologie

source: Template based graphic design
ro: Design grafic bazat pe template-uri

source: Thank you for contacting us! We will be in touch shortly.
ro: Va multumim ca ne-ati contactat! Vom reveni catre dvs. in curand.

source: This field is required
ro: Acest camp este obligatoriu

source: Top performance. Top SEO.
ro: Performanta de top. SEO de top.

source: Want to get full ownership of your app/website? Buy it anytime for a small fee. No questions asked
ro: Vrei sa detii in totalitate site-ul web/aplicatia ? Cumpara oricand pentru un tarif accesibil. Fara intrebari.

source: Want to host it somewhere else ? You can buy it anytime
ro: Vrei sa il gazduiesti in alta parte ? Il poti cumpara oricand la un pret fix.

source: We <0/> small businesses and startups.
ro: Iubim <0/> afacerile mici si startup-urile.

source: We future proof your business. Forget about <0>low performance, security flawed</0> site creators or Wordpress sites: with us you get hand crafted cutting edge tech.
ro: Iti ducem afacerea in viitor. Poti uita de site-uri Wordpress sau create online, <0>cu o performanta slaba si probleme de securitate</0>: cu noi primesti site-uri web dezvoltate manual, linie cu linie, cu o technologie de varf.

source: We host your website. All in the same monthly price
ro: Iti gazduim site-ul. Inclus bineinteles in abonamentul lunar.

source: We offer an addon subscription for all websites hosted with us: PPC and Social Media Marketing for a flat fee
ro: Oferim un abonament extra pentru toate site-urile create de noi: PPC si Social Media Marketing la un pret fix.

source: We permantently monitor your website for any issues
ro: Monitorizam in permanenta site-ul pentru probleme

source: We take care of everything: hosting, maintenance, security, on page SEO optimizations, support, and more. All included in the monthly fee.
ro: Ne ocupam de absolut tot: gazduite site, mentenanta, securitate, servicii de on-page SEO, suport technic si altele. Totul inclus in abonamentul lunar.

source: We take care of the monthly security updates, performance optimizations, tech stack upgrades and we make sure your website is always up and running. At no extra charge.
ro: Ne ocupam de upgrade-uri lunare de securitate, optimizari de performanta, upgrade-uri de tech stack si ne asiguram ca site-ul tau functioneaza in permanenta. Fara costuri extra.

source: We use latest tech. Not unsecure plugins. Not bloated themes. Not slow page builders. We hand code your website for top performance and SEO.
ro: Folosim technologie de ultima ora. Fara plugin-uri cu probleme de securitate. Fara pagini care se incarca greu. Codam totul manual pentru performanta de top si beneficii SEO.

source: We're experts in putting your business online. We hand craft perfectly optimized websites and we maintain them for you
ro: Suntem experti in ati pune afacerea online. Dezvoltam manual site-uri web perfect optimizate si le mentinem pentru tine.

source: web sites & apps
ro: site-uri web & aplicatii

source: Website development
ro: Dezvoltare web

source: What is included
ro: Ce este inclus

source: Why not I should just use a website builder (like Wix etc) ?
ro: De ce nu as folosi pur si simplu un website builder ( gen Wix etc ) ?

source: Why subscribe ?
ro: De ce sa te abonezi ?

source: World class hosting included
ro: Gazduire de top inclusa

source: Your Name
ro: Numele dvs.
